app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "My article description"], ["updated_at", "2020-12-18 06:41:37.435646"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(title: params[:article][:title])